// [#1.] array의 여러가지 형태
let arr1 = [];
let arr2 = [1, 2, 3];
let arr3 = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
let arr8 = new Array(3);
let arr9 = new Array(4, 5, 6);

arr3[0]; // [1, 2, 3]
arr3[1]; // [4, 5, 6]
arr3[2]; // [7, 8, 9]
arr3[1][2]; // 6

let arr4 = ['hyeonji', 23, 158]; // 여러개 타입이 혼합되어 쓰는 것은 권장 X
arr4[0]; // 'hyeonji'
arr4[0][3]; // 'o'


// [#2.] array의 길이 출력
let arr5 = [1, 2, 3];
arr5.length; // 3
arr5.length = 100; //[1, 2, 3, empty × 97]

let arr6 = [[1, 2, 3], [4, 5, 6], [7, 8, 9]];
arr6.length; // 3
arr6.flat().length; // 9

let arr7 = [[[10, 20], [10, [10, 20]], 3],
            [[10, 20], [10, [10, 20]], 6],
            [[10, 20], [10, [10, 20]], 9]];
arr7.flat(); // [Array(2), Array(2), 3, Array(2), Array(2), 6, Array(2), Array(2), 9]
arr7.flat().flat().flat(); // [10, 20, 10, 10, 20, 3, 10, 20, 10, 10, 20, 6, 10, 20, 10, 10, 20, 9]
arr7.flat(3); // [10, 20, 10, 10, 20, 3, 10, 20, 10, 10, 20, 6, 10, 20, 10, 10, 20, 9]
arr7.flat(Infinity); // [10, 20, 10, 10, 20, 3, 10, 20, 10, 10, 20, 6, 10, 20, 10, 10, 20, 9]

